# SegmentLengthsDisplayOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetailType..::..SegmentLengthsDisplayOption Property
RebarBendingDetailType Class See Also
---
Identifies if the segment lengths are represented using dimensions or just as text.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public BendingDetailSegmentLengthsDisplayOptions SegmentLengthsDisplayOption { get; set; }
```

Visual Basic
---
```text
Public Property SegmentLengthsDisplayOption As BendingDetailSegmentLengthsDisplayOptions
	Get
	Set
```

Visual C++
---
```text
public:
property BendingDetailSegmentLengthsDisplayOptions SegmentLengthsDisplayOption {
	BendingDetailSegmentLengthsDisplayOptions get ();
	void set (BendingDetailSegmentLengthsDisplayOptions value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace